app/controllers/api/doodles_controller.rb

SELECT  "doodles".* FROM "doodles" INNER JOIN "locations" ON "locations"."id" = "doodles"."location_id" LIMIT 20 OFFSET 0
---
	  def index

	  	if params[:lat].present? and params[:long].present? and params[:range].present?

		  	@location_origin = Location.new
		  	@location_origin.lat = @lat
		  	@location_origin.lng = @long
		  	@locations = Location.within(@range, :origin => @location_origin).order(:created_at).all.limit(@limit).offset(@offset);

		  	@doodles = []

		  	@locations.each do |loc|
		  		@doodles << Doodle.where("location_id = ?", loc.id)
				end

				respond_with :api, @doodles
			else
		  	@doodles = Doodle.all.limit(@limit).offset(@offset)

SELECT  "doodles".* FROM "doodles" INNER JOIN "locations" ON "locations"."id" = "doodles"."location_id"  ORDER BY "doodles"."id" DESC LIMIT 1
---
	  def create

	  	@doodle = Doodle.new
	  	@doodle.doodle_text = params[:doodle_text]
	  	@doodle.end_user_id = params[:end_user_id]
	  	@doodle.location = Location.new(lat: params[:lat], lng: params[:long])
	  	@doodle.save

	  	@doodleLocation = Doodle.joins(:location).last