app/controllers/api/doodles_controller.rb

SELECT "doodles".* FROM "doodles" WHERE (doodle_text LIKE '%Düsseldorf%')
SELECT "locations".* FROM "locations" WHERE ((
SELECT  * FROM "doodles" INNER JOIN "locations" ON "locations"."id" = "doodles"."location_id"  ORDER BY "doodles"."created_at" DESC LIMIT 20 OFFSET 0
---
	  def index

	  	query_term_params

	  	if @query

	  		@doodle = Doodle.where("doodle_text LIKE ?", "%#{@query}%")
	  		respond_with :api, @doodle

	  	elsif params[:lat].present? and params[:long].present? and params[:range].present?

		  	@location_origin = Location.new
		  	@location_origin.lat = @lat
		  	@location_origin.lng = @long
		  	@locations = Location.within(@range, :origin => @location_origin).order(:created_at).all.limit(@limit).offset(@offset);

		  	@doodles = []

		  	@locations.each do |loc|
		  		@doodles << Doodle.where("location_id = ?", loc.id)
				end

				respond_with :api, @doodles
			else
		  	@doodles = Doodle.all.limit(@limit).offset(@offset).order(created_at: :desc)

SELECT  "tags".* FROM "tags" WHERE (name = 'working')  ORDER BY "tags"."id" ASC LIMIT 1
INSERT INTO "locations" ("latitude", "longitude", "doodle_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["latitude", 123.0], ["longitude", 123.0], ["doodle_id", 14], ["created_at", "2015-02-25 11:18:19.276191"], ["updated_at", "2015-02-25 11:18:19.276191"]]
INSERT INTO "doodles" ("doodle_text", "end_user_id", "tag_id", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["doodle_text", "En doodle i malmö"], ["end_user_id", 43], ["tag_id", 2], ["location_id", 15], ["created_at", "2015-02-25 21:23:57.321431"], ["updated_at", "2015-02-25 21:23:57.321431"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "hangin out"], ["created_at", "2015-02-25 20:51:42.509660"], ["updated_at", "2015-02-25 20:51:42.509660"]]
---
	  def create

	  	if end_user_authenticate

			  	@tag = Tag.where("name = ?", params[:tag_name]).first

			  	if @tag == nil
			  		@tag = Tag.new(name: params[:tag_name])
			  	end

			  	@location = Location.new(lat: params[:lat], lng: params[:long])
			  	@location.save

			  	@doodle = Doodle.new
			  	@doodle.doodle_text = params[:doodle_text]
			  	@doodle.end_user_id = @token_payload[0]["user_id"]
			  	@doodle.tag = @tag
			  	@doodle.location = @location
			  	@doodle.save

SELECT  "doodles".* FROM "doodles" WHERE "doodles"."id" = ? LIMIT 1  [["id", 1]]
---
	  def show
		  @doodle = Doodle.where("doodles.id = ?", params[:id])

SELECT "locations".* FROM "locations"
---
	  def getAllLocations
	  	@locations = Location.all

SELECT  "doodles".* FROM "doodles" WHERE "doodles"."id" = NULL LIMIT 1
UPDATE "doodles" SET "doodle_text" = ?, "updated_at" = ? WHERE "doodles"."id" = ?  [["doodle_text", "HEPP HEPP HEPP HEPP HEPPZZZZZZ"], ["updated_at", "2015-02-26 16:50:02.509998"], ["id", 43]]
---
	  def update
	  	if end_user_authenticate

	  			@doodle = Doodle.find(params[:id])

	  			@user_id_doodle = @doodle.end_user_id

	  			# Checking if doodles user-id is corresponding requesting users jwt
	  			if @token_payload[0]["user_id"] == @user_id_doodle

			  		@doodle = Doodle.update(params[:id], doodle_text: params[:doodle_text])

SELECT  "doodles".* FROM "doodles" WHERE "doodles"."id" = ? LIMIT 1  [["id", 31]]
DELETE FROM "doodles" WHERE "doodles"."id" = ?  [["id", 31]]
---
	  def destroy
	  	if end_user_authenticate

	  			@doodle = Doodle.find(params[:id])

	  			@user_id_doodle = @doodle.end_user_id

	  			# Checking if doodles user-id is corresponding requesting users jwt
	  			if @token_payload[0]["user_id"] == @user_id_doodle
			  		Doodle.destroy(params[:id])

SELECT  "tags".* FROM "tags" WHERE (name = 'hepp')  ORDER BY "tags"."id" ASC LIMIT 1
SELECT "doodles".* FROM "doodles" INNER JOIN "tags" ON "tags"."id" = "doodles"."tag_id" WHERE "tags"."name" = ?  [["name", "\#{@tag.name}"]]
---
	  def doodles_by_tag

	  	@tag = Tag.where("name = ?", params[:tag_name]).first

	  	@doodles = Doodle.joins(:tag).where(:tags => {:name => @tag.name})