app/controllers/api/end_users_controller.rb

		def getUsersDoodles

			@doodles = Doodle.where("end_user_id = ?", params[:end_user_id]).order(:created_at).all.limit(@limit).offset(@offset)
---
SELECT  "doodles".* FROM "doodles" WHERE (end_user_id = '6')  ORDER BY "doodles"."created_at" ASC LIMIT 20 OFFSET 0

		def getDoodlesByUsername

			@end_user = EndUser.where("username = ?", params[:end_user_username]).first;

			@doodles = Doodle.where("end_user_id = ?", @end_user.id).order(:created_at).all.limit(@limit).offset(@offset)
---
SELECT  "end_users".* FROM "end_users" WHERE (username = 'hejhej')  ORDER BY "end_users"."id" ASC LIMIT 1
SELECT  "doodles".* FROM "doodles" WHERE (end_user_username = 'hejhej')  ORDER BY "doodles"."created_at" ASC LIMIT 20 OFFSET 0

		def create

			@end_user = EndUser.new(end_user_params)


			if @end_user.save
---
INSERT INTO "end_users" ("username", "email", "password_digest", "bio_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

		def index
			@users = EndUser.all
---
SELECT "end_users".* FROM "end_users"

		def api_auth

	    end_user = EndUser.find_by(email: params[:email].downcase)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."email" = ? LIMIT 1  [["email", "hej@hej.se"]]