app/controllers/api/tags_controller.rb

SELECT  "tags".* FROM "tags" LIMIT 20 OFFSET 0
---
		def index
			@tags = Tag.all.limit(@limit).offset(@offset)