app/controllers/admin_login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "users" SET "authkey" = ?, "admin_revoked_key" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authkey", nil], ["admin_revoked_key", "t"], ["updated_at", "2015-02-19 08:00:26.434304"], ["id", 12]]
---
  def admin_revoke_key
    @user = User.find(params[:user])
    @user.authkey = nil;
    @user.admin_revoked_key = true;
    @user.save