app/controllers/apikeys_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]
---
	def show
		@user = User.find(session[:userid])

SELECT "users".* FROM "users"
---
	def admin_page
    	@users = User.all