app/controllers/doodles_controller.rb

	  def index
	  	@doodle = Doodle.all
---
SELECT "doodles".* FROM "doodles"

	  def create
	  	@doodle = Doodle.new(doodle_params)    # using strong parameters
	  	@doodle.save
---
INSERT INTO "doodles" ("doodle_text", "created_at", "updated_at") VALUES (?, ?, ?)  [["doodle_text", "hej svejs"], ["created_at", "2015-02-23 10:00:05.529384"], ["updated_at", "2015-02-23 10:00:05.529384"]]