app/controllers/users_controller.rb

  def admin_revoke_key
    @user = User.find(params[:user])
    @user.authkey = nil;
    @user.admin_revoked_key = true;
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "authkey" = ?, "admin_revoked_key" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authkey", nil], ["admin_revoked_key", "t"], ["updated_at", "2015-02-09 16:17:09.870068"], ["id", 2]]