app/controllers/users_controller.rb

INSERT INTO "users" ("email", "webbsite_url", "website_name", "authkey", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "feij"], ["webbsite_url", "jnfee"], ["website_name", "jnefj"], ["authkey", "1111"], ["created_at", "2015-02-02 12:33:54.001740"], ["updated_at", "2015-02-02 12:33:54.001740"]]
---
  def create
  	@user = User.new(user_params)

    # @user.is_user_admin = true;

  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "hejhej@hej.se"]]
---
  def login
    u = User.find_by_email(params[:email])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "admin@admin.se"]]
---
  def admin_login
    u = User.find_by_email(params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 15]]
UPDATE "users" SET "authkey" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authkey", "0361e8efaff2d9cf950c00c2b6c27352"], ["updated_at", "2015-02-19 10:14:30.525845"], ["id", 15]]
---
  def generate_access_token

      @user = User.find(session[:userid])
      @user.authkey = SecureRandom.hex
      @user.save